Lyque/diplomaterv/Projects/TrueSTUDIO/STM32F4_CubeMX_FreeRTOS/Src/main.c
#if defined(MEAS_W_LOAD)
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *UartHandle)
{
	if(UartHandle->Instance == USART6)
	{
		// Az adat karakterenként érkezik, amit a MessageQ-ba töltünk.
		osMessagePut(uart6Receive_xMessage, uart6Data[0], 0);
		// Majd újra elindítjuk az adat vételét.
		HAL_UART_Receive_IT(UartHandle, uart6Data, 1);
	}
	else if(UartHandle->Instance == USART1)
		osSemaphoreRelease(ble_xSemaphore);
	// ToDo: BLE UART-hoz is megírni az üzenet Message-be pakolását. De lehet elég egy sima szemafor.
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
	// Amennyiben overrun error lép fel, úgy töröljük a bitet, és eldobjuk az adatregiszter tartalmát (?)
	if(__HAL_UART_GET_FLAG(huart, UART_FLAG_ORE))
	{
		__HAL_UART_CLEAR_OREFLAG(huart);
		__HAL_UART_FLUSH_DRREGISTER(huart); // ToDo: Ez biztosan eldobja?
	}

	if(huart->Instance == USART6)
	{
		uint8_t i;
		uint8_t message[MESSAGE_LENGTH] = "error   :error\n";

		// Ha a GUI-tól jött vezérlõparancs, akkor jelezzük, hogy hibás volt az átvitel.
		if(uart6Send_xMessage!=NULL)
			for(i=0;i<MESSAGE_LENGTH;i++)
			{
				osMessagePut(uart6Send_xMessage, message[i], 10);
			}
		// Majd újra elindítjuk az adat vételét.
		HAL_UART_Receive_IT(huart, uart6Data, 1);
	}
	// ToDo: BLE UART esetére is megírni egy hibakezelést
}

void RemoteControllerConnected()
{
	GPIO_PinState state;
	uint8_t message[MESSAGE_LENGTH];
	uint8_t value[VALUE_LENGTH+1];
	uint8_t i;

	// led0 értékének kiolvasása és elküldése
	memcpy(message, "led0    :", 9);

	state = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_8);
	if(state == GPIO_PIN_SET)
	{
		value[0] = 0xAA;
		value[1] = 0xAA;
		value[2] = 0xAA;
		value[3] = 0xAA;
		value[4] = '\n';
	}
	else
	{
		value[0] = 0x55;
		value[1] = 0x55;
		value[2] = 0x55;
		value[3] = 0x55;
		value[4] = '\n';
	}

	memcpy(&message[9], value, 5);

	if(uart6Send_xMessage!=NULL)
		for(i=0;i<MESSAGE_LENGTH;i++)
			osMessagePut(uart6Send_xMessage, message[i], 10);

	if(sdCardWrite_xMessage!=NULL)
		for(i=0;i<MESSAGE_LENGTH;i++)
		{
			osMessagePut(sdCardWrite_xMessage, message[i], 10);
		}

	// led1 értékének kiolvasása és elküldése
	memcpy(message, "led1    :", 9);

	state = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_9);
	if(state == GPIO_PIN_SET)
	{
		value[0] = 0xAA;
		value[1] = 0xAA;
		value[2] = 0xAA;
		value[3] = 0xAA;
		value[4] = '\n';
	}
	else
	{
		value[0] = 0x55;
		value[1] = 0x55;
		value[2] = 0x55;
		value[3] = 0x55;
		value[4] = '\n';
	}

	memcpy(&message[9], value, 5);

	if(uart6Send_xMessage!=NULL)
		for(i=0;i<MESSAGE_LENGTH;i++)
			osMessagePut(uart6Send_xMessage, message[i], 10);

	if(sdCardWrite_xMessage!=NULL)
		for(i=0;i<MESSAGE_LENGTH;i++)
		{
			osMessagePut(sdCardWrite_xMessage, message[i], 10);
		}

	// switch0 értékének kiolvasása és elküldése
	memcpy(message, "switch0 :", 9);

	state = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_10);
	if(state == GPIO_PIN_SET)
	{
		value[0] = 0xAA;
		value[1] = 0xAA;
		value[2] = 0xAA;
		value[3] = 0xAA;
		value[4] = '\n';
	}
	else
	{
		value[0] = 0x55;
		value[1] = 0x55;
		value[2] = 0x55;
		value[3] = 0x55;
		value[4] = '\n';
	}

	memcpy(&message[9], value, 5);

	if(uart6Send_xMessage!=NULL)
		for(i=0;i<MESSAGE_LENGTH;i++)
			osMessagePut(uart6Send_xMessage, message[i], 10);

	if(sdCardWrite_xMessage!=NULL)
		for(i=0;i<MESSAGE_LENGTH;i++)
		{
			osMessagePut(sdCardWrite_xMessage, message[i], 10);
		}

	// switch1 értékének kiolvasása és elküldése
	memcpy(message, "switch1 :", 9);

	state = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_11);
	if(state == GPIO_PIN_SET)
	{
		value[0] = 0xAA;
		value[1] = 0xAA;
		value[2] = 0xAA;
		value[3] = 0xAA;
		value[4] = '\n';
	}
	else
	{
		value[0] = 0x55;
		value[1] = 0x55;
		value[2] = 0x55;
		value[3] = 0x55;
		value[4] = '\n';
	}

	memcpy(&message[9], value, 5);

	if(uart6Send_xMessage!=NULL)
		for(i=0;i<MESSAGE_LENGTH;i++)
			osMessagePut(uart6Send_xMessage, message[i], 10);

	if(sdCardWrite_xMessage!=NULL)
		for(i=0;i<MESSAGE_LENGTH;i++)
		{
			osMessagePut(sdCardWrite_xMessage, message[i], 10);
		}
}

void ChangeLed0State(GPIO_PinState state)
{
	GPIO_PinState newState;
	uint8_t message[MESSAGE_LENGTH];
	uint8_t value[VALUE_LENGTH+1];
	uint8_t i;

	memcpy(message, "led0    :", 9);

	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_8, state);
	osDelay(1);
	newState = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_8);
	if(newState == GPIO_PIN_SET)
	{
		value[0] = 0xAA;
		value[1] = 0xAA;
		value[2] = 0xAA;
		value[3] = 0xAA;
		value[4] = '\n';
	}
	else
	{
		value[0] = 0x55;
		value[1] = 0x55;
		value[2] = 0x55;
		value[3] = 0x55;
		value[4] = '\n';
	}

	memcpy(&message[9], value, 5);

	if(uart6Send_xMessage!=NULL)
		for(i=0;i<MESSAGE_LENGTH;i++)
			osMessagePut(uart6Send_xMessage, message[i], 10);

	if(sdCardWrite_xMessage!=NULL)
		for(i=0;i<MESSAGE_LENGTH;i++)
		{
			osMessagePut(sdCardWrite_xMessage, message[i], 10);
		}
}

void ChangeLed1State(GPIO_PinState state)
{
	GPIO_PinState newState;
	uint8_t message[MESSAGE_LENGTH];
	uint8_t value[VALUE_LENGTH+1];
	uint8_t i;

	memcpy(message, "led1    :", 9);

	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_9, state);
	osDelay(1);
	newState = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_9);
	if(newState == GPIO_PIN_SET)
	{
		value[0] = 0xAA;
		value[1] = 0xAA;
		value[2] = 0xAA;
		value[3] = 0xAA;
		value[4] = '\n';
	}
	else
	{
		value[0] = 0x55;
		value[1] = 0x55;
		value[2] = 0x55;
		value[3] = 0x55;
		value[4] = '\n';
	}

	memcpy(&message[9], value, 5);

	if(uart6Send_xMessage!=NULL)
		for(i=0;i<MESSAGE_LENGTH;i++)
			osMessagePut(uart6Send_xMessage, message[i], 10);

	if(sdCardWrite_xMessage!=NULL)
		for(i=0;i<MESSAGE_LENGTH;i++)
		{
			osMessagePut(sdCardWrite_xMessage, message[i], 10);
		}
}

void StartSwitchChangedTask(void const * argument)
{
	GPIO_PinState sw0_state = GPIO_PIN_RESET;
	GPIO_PinState sw1_state = GPIO_PIN_RESET;
	uint8_t message[MESSAGE_LENGTH];
	uint8_t value[VALUE_LENGTH+1];
	uint16_t gpioPin = 0;
	osEvent event;
	uint8_t i;

	osMessageQDef(SWITCHMES, 1, uint16_t);
	switchInterrupt_xMessage = osMessageCreate(osMessageQ(SWITCHMES), NULL);

	sw0_state = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_10);
	sw1_state = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_11);

	while(1)
	{
		event = osMessageGet(switchInterrupt_xMessage, portMAX_DELAY);

		if(event.status == osEventMessage)
		{
			gpioPin = (uint16_t)event.value.p;

			memcpy(message, "switch", 6);

			if(gpioPin == GPIO_PIN_10)
			{
				sw0_state = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_10);

				memcpy(&message[6], "0 :",3);

