Lyque/diplomaterv/Projects/TrueSTUDIO/STM32F4_CubeMX_FreeRTOS/Src/main.c
				if(sw0_state == GPIO_PIN_SET)
				{
					value[0] = 0xAA;
					value[1] = 0xAA;
					value[2] = 0xAA;
					value[3] = 0xAA;
					value[4] = '\n';
				}
				else
				{
					value[0] = 0x55;
					value[1] = 0x55;
					value[2] = 0x55;
					value[3] = 0x55;
					value[4] = '\n';
				}

				memcpy(&message[9], value, 5);
			}
			else if(gpioPin == GPIO_PIN_11)
			{
				sw1_state = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_11);

				memcpy(&message[6], "1 :",3);

				if(sw1_state == GPIO_PIN_SET)
				{
					value[0] = 0xAA;
					value[1] = 0xAA;
					value[2] = 0xAA;
					value[3] = 0xAA;
					value[4] = '\n';
				}
				else
				{
					value[0] = 0x55;
					value[1] = 0x55;
					value[2] = 0x55;
					value[3] = 0x55;
					value[4] = '\n';
				}

				memcpy(&message[9], value, 5);
			}

			if(uart6Send_xMessage!=NULL)
				for(i=0;i<MESSAGE_LENGTH;i++)
					osMessagePut(uart6Send_xMessage, message[i], 10);
			if(sdCardWrite_xMessage!=NULL)
				for(i=0;i<MESSAGE_LENGTH;i++)
				{
					osMessagePut(sdCardWrite_xMessage, message[i], 10);
				}
		}

		osDelay(1);
	}
}

void StartTempMeasureTask(void const * argument)
{
	uint32_t adc_val = 0;

	uint8_t message[MESSAGE_LENGTH];
	uint8_t i;

	memcpy(message, "loctemp :", 9);

	while(1)
	{
		HAL_ADC_Start(&hadc1);
		if(HAL_ADC_PollForConversion(&hadc1, portMAX_DELAY) == HAL_OK)
		{
			adc_val = HAL_ADC_GetValue(&hadc1);
		}
		else
		{
			adc_val = 0xFFFFFFFF;
		}

		memcpy(&message[9], &adc_val, 4);
		message[13] = '\n';

		if(uart6Send_xMessage!=NULL)
			for(i=0;i<MESSAGE_LENGTH;i++)
				osMessagePut(uart6Send_xMessage, message[i], 10);

		if(sdCardWrite_xMessage!=NULL)
			for(i=0;i<MESSAGE_LENGTH;i++)
			{
				osMessagePut(sdCardWrite_xMessage, message[i], 10);
			}

		osDelay(100);
	}
}

void StartPotmeterMeasureTask(void const * argument)
{
	uint32_t adc_val = 0;

	uint8_t message[MESSAGE_LENGTH];
	uint8_t i;

	memcpy(message, "potmeter:", 9);

	while(1)
	{
		HAL_ADC_Start(&hadc2);
		if(HAL_ADC_PollForConversion(&hadc2, portMAX_DELAY) == HAL_OK)
		{
			adc_val = HAL_ADC_GetValue(&hadc2);
		}
		else
		{
			adc_val = 0xFFFFFFFF;
		}

		memcpy(&message[9], &adc_val, 4);
		message[13] = '\n';

		if(uart6Send_xMessage!=NULL)
			for(i=0;i<MESSAGE_LENGTH;i++)
			{
				osMessagePut(uart6Send_xMessage, message[i], 10);
			}

		if(sdCardWrite_xMessage!=NULL)
			for(i=0;i<MESSAGE_LENGTH;i++)
			{
				osMessagePut(sdCardWrite_xMessage, message[i], 10);
			}

		osDelay(100);
	}
}

void BLE_Send(uint8 len1,uint8* data1,uint16 len2,uint8* data2) {
	uint8_t message[64];
	uint8_t length;
	uint8_t i;

	length = len1+len2;
	memcpy(message, &length, 1);
	memcpy(&message[1],data1,len1);
	memcpy(&message[len1+1],data2,len2);
	length = len1+len2;
	//Add to UART FIFO
	if(bleSend_xMessage != NULL)
		for(i=0;i<length+1;i++)
		{
			osMessagePut(bleSend_xMessage, message[i], 10);
		}
}

void StartBLETask(void const * argument)
{
	// BGLib config
	bglib_output = &BLE_Send;

	while(1)
	{
		ble_cmd_system_hello();
		// ToDo: Taszk implementálása. A taszk elvégzi a BLE112 konfigurálását, majd periodikusan lekérdezi a három szenzorértéket. \
		Az egyes parancsok kiküldése között meg kell várni a választ. Ezt a fogadó taszk által billentett szemaforral oldom majd meg.
		osDelay(10000);
	}
}

void StartBLESendTask(void const * argument)
{
	osMessageQDef(BLEMES, 140, uint8_t);
	bleSend_xMessage = osMessageCreate(osMessageQ(BLEMES), NULL);

	osEvent event;
	uint8_t character;
	uint16_t size = sizeof(character)/sizeof(uint8_t);

	while(1)
	{
		event = osMessageGet(bleSend_xMessage, portMAX_DELAY);
		if(event.status == osEventMessage)
		{
			character = (uint32_t)event.value.p;

			// Az üzenetek küldése közben ne legyen megszakítás!
			portENTER_CRITICAL();
			HAL_UART_Transmit(&huart1, &character, size, 100);
			portEXIT_CRITICAL();
		}
	}
}

void StartBLEReceiveTask(void const * argument)
{
	uint8_t data;
	uint16_t size = sizeof(data)/sizeof(uint8_t);

	osSemaphoreDef(BLESEM);
	ble_xSemaphore = osSemaphoreCreate(osSemaphore(BLESEM), 1);

	osSemaphoreWait(ble_xSemaphore, 0);
	while(1)
	{
		HAL_UART_Receive_IT(&huart1, &data, size);
		osDelay(1);
		if(osSemaphoreWait(ble_xSemaphore, portMAX_DELAY) == osOK)
		{
			do
			{
				// ToDo: BLE112-tõl beérkezõ üzenet feldolgozását végzõ taszk. Az egyes üzeneteket parse-olni kell, majd szemaforral jelezni kell a fõ taszknak, \
				hogy folytathatja a feladatát.
			} while(HAL_UART_Receive(&huart1, &data, size, 0) == HAL_OK);
		}
		osDelay(10);
	}
}

void StartUART6Task(void const * argument)
{
	// Beérkezõ parancsok lehetséges (érvényes) értékei
	const char connectString[] = "connect ";
	const char led0String[] = "led0    ";
	const char led1String[] = "led1    ";

	uint8_t data[MESSAGE_LENGTH];
	uint8_t entity[ENTITY_LENGTH+1];
	uint8_t value[VALUE_LENGTH];
	uint8_t i;
	osEvent event;

	osMessageQDef(UART6RECEIVEMES, 140, uint8_t);
	uart6Receive_xMessage = osMessageCreate(osMessageQ(UART6RECEIVEMES), NULL);

	// Egyszerre csak egy karaktert várunk.
	HAL_UART_Receive_IT(&huart6, uart6Data, 1);
	while(1)
	{
		i = 0;
		while(i<MESSAGE_LENGTH)
		{
			// Az elsõ karakterre folyamatosan várunk, viszont ha nem érkezik rövid idõn belül új karakter, akkor feltételezzük, hogy hiba történt \
			és eldobjuk az eddigi csomagot, illetve a következõ sorvége karakterig eldobjuk a karaktereket (vagy kiürítjük a MessageQ-t)
			if(i==0)
				event = osMessageGet(uart6Receive_xMessage, portMAX_DELAY);
			else
				event = osMessageGet(uart6Receive_xMessage, 10);

			if(event.status == osEventMessage)
			{
				data[i] = event.value.p;
				i++;
			}
			else
				i=0;
		}
		// Beérkezett adat feldarabolása
		memcpy(entity, data, ENTITY_LENGTH);
		entity[ENTITY_LENGTH] = '\0';
		memcpy(value, &data[ENTITY_LENGTH+1], VALUE_LENGTH);

		// A GUI csatlakozott
		if(!strcmp(entity, connectString))
		{
			RemoteControllerConnected();
		}
		// LED0 állítása
		else if(!strcmp(entity, led0String))
		{
			if(value[0] == 0xAA && value[1] == 0xAA && value[2] == 0xAA && value[3] == 0xAA)
				ChangeLed0State(GPIO_PIN_SET);
			else
				ChangeLed0State(GPIO_PIN_RESET);
		}
		// LED1 állítása
		else if(!strcmp(entity, led1String))
		{
			if(value[0] == 0xAA && value[1] == 0xAA && value[2] == 0xAA && value[3] == 0xAA)
				ChangeLed1State(GPIO_PIN_SET);
			else
				ChangeLed1State(GPIO_PIN_RESET);
		}
		else
		{
			// Valószínûleg bithiba történt, esetleg nem érkezett meg valamelyik byte, ekkor a további hibák\
			akkumulálódását elkerülvén megkeressük a következõ sorvége karaktert, vagy kiürítjük a MessageQ-t
			do
			{
				event = osMessageGet(uart6Receive_xMessage,0);
			} while(event.status == osEventMessage && event.value.p !='\n');
		}
	}
	// ToDo: Valamiért kifagy a parancsfogadás! (Talán már javítja önmagát.)
}

