Lyque/diplomaterv/Projects/TrueSTUDIO/STM32F4_CubeMX_FreeRTOS/Src/main.c
void StartUART6SendTask(void const * argument)
{
	osEvent event;
	uint8_t character;
	uint16_t size = sizeof(character)/sizeof(uint8_t);

	osMessageQDef(UART6MES, 140, uint8_t);
	uart6Send_xMessage = osMessageCreate(osMessageQ(UART6MES), NULL);

	while(1)
	{
		event = osMessageGet(uart6Send_xMessage, portMAX_DELAY);
		if(event.status == osEventMessage)
		{
			character = (uint32_t)event.value.p;

			// Az üzenetek küldése közben ne legyen megszakítás!
			portENTER_CRITICAL();
			HAL_UART_Transmit(&huart6, &character, size, 100);
			portEXIT_CRITICAL();
		}
	}
}

// FatFS open for append. Source: http://elm-chan.org/fsw/ff/res/app1.c
FRESULT open_append (
    FIL* fp,            /* [OUT] File object to create */
    const uint8_t* path    /* [IN]  File name to be opened */
)
{
    FRESULT fr;

    /* Opens an existing file. If not exist, creates a new file. */
    fr = f_open(fp, (char*)path, FA_WRITE | FA_OPEN_ALWAYS);

    if (fr == FR_OK) {
        /* Seek to end of the file to append data */
    	fr = f_lseek(fp, f_size(fp));
        if (fr != FR_OK)
            f_close(fp);
    }
    return fr;
}

void StartSDCardTask(void const * argument)
{
	// SDCard deinicializálásához szükséges külsõ változó
	extern Disk_drvTypeDef  disk;

	osMessageQDef(SDCARDMES, 255, uint8_t);
	sdCardWrite_xMessage = osMessageCreate(osMessageQ(SDCARDMES), NULL);

	FATFS fileSystem;
	FIL logFile;
	UINT testBytes;
	FRESULT res;

	osEvent event;
	uint8_t cardMounted = 0;

	int i;
	uint8_t message[255];

	while(1)
	{
		i = 0;
		memset(message,0,255);

		// CD láb ellenõrzése
		event = osMessageGet(sdCardWrite_xMessage, portMAX_DELAY);
		if(event.status == osEventMessage)
		{
			message[i] = (uint32_t)event.value.p;

			do
			{
				i++;

				event = osMessageGet(sdCardWrite_xMessage, 0);
				if(event.status == osEventMessage)
					message[i] = (uint32_t)event.value.p;
			} while(event.status == osEventMessage);

			if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_15) == GPIO_PIN_RESET)
			{
				if(!cardMounted)
				{
					if(f_mount(&fileSystem, SD_Path, 1) == FR_OK)
					{
						uint8_t path[12] = "logfile.txt";
						path[11] = '\0';

						cardMounted = 1;

						// Ez nem szép dolog, de enélkül a szektorméret elérése után megáll a tudomány
						portENTER_CRITICAL();
						res = open_append(&logFile, path);
						portEXIT_CRITICAL();

						if(res == FR_OK)
						{
							portENTER_CRITICAL();
							res = f_write(&logFile, message, i, &testBytes);
							portEXIT_CRITICAL();
						}
						if(res == FR_OK)
						{
							portENTER_CRITICAL();
							res = f_sync(&logFile);
							portEXIT_CRITICAL();
						}
						if(res == FR_OK)
						{
							//portENTER_CRITICAL();
							res = f_close(&logFile);
							//portEXIT_CRITICAL();
						}

						// Hiba esetén leválasztjuk, majd újra felcsatoljuk a kártyát
						if(res != FR_OK)
						{
							f_mount(NULL, SD_Path, 1);
							// Ez nem szép dolog, de enélkül nem inicializálja fel többször az SDCardot
							disk.is_initialized[0] = 0;
							cardMounted = 0;
						}
						else
							HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);
					}
				}
				else
				{
					uint8_t path[12] = "logfile.txt";
					path[11] = '\0';

					// Ez nem szép dolog, de enélkül a szektorméret elérése után megáll a tudomány
					portENTER_CRITICAL();
					res = open_append(&logFile, path);
					portEXIT_CRITICAL();

					if(res == FR_OK)
					{
						portENTER_CRITICAL();
						res = f_write(&logFile, message, i, &testBytes);
						portEXIT_CRITICAL();
					}
					if(res == FR_OK)
					{
						portENTER_CRITICAL();
						res = f_sync(&logFile);
						portEXIT_CRITICAL();
					}
					if(res == FR_OK)
					{
						//portENTER_CRITICAL();
						res = f_close(&logFile);
						//portEXIT_CRITICAL();
					}

					// Hiba esetén leválasztjuk, majd újra felcsatoljuk a kártyát
					if(res != FR_OK)
					{
						f_mount(NULL, SD_Path, 1);
						// Ez nem szép dolog, de enélkül nem inicializálja fel többször az SDCardot
						disk.is_initialized[0] = 0;
						cardMounted = 0;
					}
					else
						HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);
				}
			}
			else
			{
				if(cardMounted)
				{
					f_mount(NULL, SD_Path, 1);
					// Ez nem szép dolog, de enélkül nem inicializálja fel többször az SDCardot
					disk.is_initialized[0] = 0;
				}

				cardMounted = 0;
			}
		}
	}
}
#endif // defined(MEAS_W_LOAD)
/* USER CODE END 4 */

/* StartStartMeasureTask function */
void StartStartMeasureTask(void const * argument)
{
  /* init code for FATFS */
#if defined(MEAS_W_LOAD)
  MX_FATFS_Init();
#endif // defined(MEAS_W_LOAD)

  /* USER CODE BEGIN 5 */

  /* Infinite loop */
  while(1)
  {
#if defined(MEAS_TASK_SWITCHING_TIME) || defined(MEAS_PREEMPTION_TIME) \
	|| defined(MEAS_SEMAPHORE_SHUFFLING_TIME) || defined(MEAS_DEADLOCK_BREAKING_TIME) || defined(MEAS_DATAGRAM_THROUGHPUT_TIME)
	  osSemaphoreRelease(measureSemaphoreA_xSemaphore);
#endif // defined(MEAS_TASK_SWITCHING_TIME) || defined(MEAS_PREEMPTION_TIME)
//|| defined(MEAS_SEMAPHORE_SHUFFLING_TIME) || defined(MEAS_DEADLOCK_BREAKING_TIME) || defined(MEAS_DATAGRAM_THROUGHPUT_TIME)

    osDelay(100);
  }
  /* USER CODE END 5 */ 
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM1 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
/* USER CODE BEGIN Callback 0 */

/* USER CODE END Callback 0 */
  if (htim->Instance == TIM1) {
    HAL_IncTick();
  }
/* USER CODE BEGIN Callback 1 */

/* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
